[Killed] BlockStatement
main/components/HelpRequest/HelpRequestForm.js:26:39
     // Note that even this complex regex may still need some tweaks
 
     const testIdPrefix = "HelpRequestForm-";
-    const handleSolvedChange = (e) => {
-        setValue("solved", e.target.checked); // Update "solved" value
-    };
+    const handleSolvedChange = (e) => {};
 
     // Stryker disable all
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "explanation": "Dokku problems",
    "requestTime": "2024-02-02T12:00",

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:27:18
 
     const testIdPrefix = "HelpRequestForm-";
     const handleSolvedChange = (e) => {
-        setValue("solved", e.target.checked); // Update "solved" value
+        setValue("", e.target.checked); // Update "solved" value
     };
 
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "explanation": "Dokku problems",
    "requestTime": "2024-02-02T12:00",

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:43:18
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-                {initialContents && (
-                
-                    <Form.Group className="mb-3" >
-                        <Form.Label htmlFor="id">Id</Form.Label>
-                        <Form.Control
-                            data-testid={testIdPrefix + "id"}
-                            id="id"
-                            type="text"
-                            {...register("id")}
-                            value={initialContents.id}
-                            disabled
-                        />
-                    </Form.Group>
-                )}
+                {false}
 
                     <Form.Group className="mb-3" >
killedBy: HelpRequestForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="HelpRequestForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:43:18
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-                {initialContents && (
-                
-                    <Form.Group className="mb-3" >
-                        <Form.Label htmlFor="id">Id</Form.Label>
-                        <Form.Control
-                            data-testid={testIdPrefix + "id"}
-                            id="id"
-                            type="text"
-                            {...register("id")}
-                            value={initialContents.id}
-                            disabled
-                        />
-                    </Form.Group>
-                )}
+                {true}
 
                     <Form.Group className="mb-3" >
killedBy: HelpRequestForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="HelpRequestForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:65:60
                             id="requesterEmail"
                             type="text"
                             isInvalid={Boolean(errors.requesterEmail)}
-                            {...register("requesterEmail", { required: "RequesterEmail is required." })}
+                            {...register("requesterEmail", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /RequesterEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:79:52
                             id="teamId"
                             type="text"
                             isInvalid={Boolean(errors.teamId)}
-                            {...register("teamId", { required: "TeamId is required." })}
+                            {...register("teamId", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /TeamId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:89:57
                     <Form.Group className="mb-3" >
                         <Form.Label htmlFor="tableOrBreakoutRoom">TableOrBreakoutRoom</Form.Label>
                         <Form.Control
-                            data-testid={testIdPrefix + "tableOrBreakoutRoom"}
+                            data-testid={testIdPrefix + ""}
                             id="tableOrBreakoutRoom"
                             type="text"
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestForm-tableOrBreakoutRoom"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:104:57
                     <Form.Group className="mb-3" >
                         <Form.Label htmlFor="requestTime">RequestTime</Form.Label>
                         <Form.Control
-                            data-testid={testIdPrefix + "requestTime"}
+                            data-testid={testIdPrefix + ""}
                             id="requestTime"
                             type="datetime-local"
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestForm-requestTime"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:108:57
                             id="requestTime"
                             type="datetime-local"
                             isInvalid={Boolean(errors.requestTime)}
-                            {...register("requestTime", { 
-                                required: "RequestTime is required."})}
+                            {...register("requestTime", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /RequestTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:149:53
 
                     <Button
                         type="submit"
-                        data-testid={testIdPrefix + "submit"}
+                        data-testid={testIdPrefix + ""}
                     >
                         {buttonLabel}
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element by: [data-testid="HelpRequestForm-submit"]

<body>
  <div>
    <form
      class=""
    >
      <div
