[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.js:61:23
         },
         {
             Header: 'Solved',
-            accessor: (row) => row.solved ? 'true' : 'false'
+            accessor: () => undefined
         }
     ];
killedBy: UserTable tests Has the expected column headers, content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
