[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestCreatePage.js:9:33
 
 export default function HelpRequestCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (helpRequest) => ({
-      url: "/api/helprequests/post",
-      method: "POST",
-      params: {
-        requesterEmail: helpRequest.requesterEmail,
-        teamId: helpRequest.teamId,
-        tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-        requestTime: helpRequest.requestTime,
-        explanation: helpRequest.explanation,
-        solved: helpRequest.solved
-      }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.js:22:40
       }
     });
 
-    const onSuccess = (helpRequest) => {
-        toast(`New helpRequest Created - id: ${helpRequest.id} requesterEmail: ${helpRequest.requesterEmail}`);
-      }
+    const onSuccess = (helpRequest) => {}
 
     const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New helpRequest Created - id: 17 requesterEmail: one@gmail.com"

Number of calls: 0
