[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestIndexPage.js:13:30
 
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/helprequest/create"
-                style={{ float: "right" }}
-            >
-                Create Help Request
-            </Button>
-        )
-    } 
-}
+  const createButton = () => {}
 
 const { data: helpRequest, error: _error, status: _status } =
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Help Request/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
