[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:30:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBOrganizationsForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
 
                 <Col>
killedBy: UCSBOrganizationsForm tests renders correctly when passing in a UCSBOrganization
statusReason: Error: Unable to find an element by: [data-testid="/UCSBOrganizationsForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:30:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBOrganizationsForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: UCSBOrganizationsForm tests renders correctly when passing in a UCSBOrganization
statusReason: Error: Unable to find an element by: [data-testid="/UCSBOrganizationsForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:54:53
                             id="orgCode"
                             type="text"
                             isInvalid={Boolean(errors.orgCode)}
-                            {...register("orgCode", { required: true })}
+                            {...register("orgCode", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /orgCode is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:57:30
                             {...register("orgCode", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.orgCode && 'orgCode is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationsForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /orgCode is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:69:42
                             id="orgTranslationShort"
                             type="text"
                             isInvalid={Boolean(errors.orgTranslationShort)}
-                            {...register("orgTranslationShort", { required: true })}
+                            {...register("", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:84:42
                             id="orgTranslation"
                             type="text"
                             isInvalid={Boolean(errors.orgTranslation)}
-                            {...register("orgTranslation", { required: true })}
+                            {...register("", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:103:66
                             id="inactive"
                             type="text"
                             isInvalid={Boolean(errors.inactive)}
-                            {...register("inactive", { required: true, pattern: /(^true$|^false$)/g})}
+                            {...register("inactive", { required: false, pattern: /(^true$|^false$)/g})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /inactive is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:103:54
                             id="inactive"
                             type="text"
                             isInvalid={Boolean(errors.inactive)}
-                            {...register("inactive", { required: true, pattern: /(^true$|^false$)/g})}
+                            {...register("inactive", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /inactive must be in the format true or false/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:106:30
                             {...register("inactive", { required: true, pattern: /(^true$|^false$)/g})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.inactive && 'inactive is required.'}
+                            {true}
                             {errors.inactive?.type === 'pattern' && 'inactive must be in the format true or false'}
                         </Form.Control.Feedback>
killedBy: UCSBOrganizationsForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /inactive is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:106:30
                             {...register("inactive", { required: true, pattern: /(^true$|^false$)/g})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.inactive && 'inactive is required.'}
+                            {errors.inactive || 'inactive is required.'}
                             {errors.inactive?.type === 'pattern' && 'inactive must be in the format true or false'}
                         </Form.Control.Feedback>
killedBy: UCSBOrganizationsForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:107:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.inactive && 'inactive is required.'}
-                            {errors.inactive?.type === 'pattern' && 'inactive must be in the format true or false'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationsForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /inactive must be in the format true or false/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:107:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.inactive && 'inactive is required.'}
-                            {errors.inactive?.type === 'pattern' && 'inactive must be in the format true or false'}
+                            {errors.inactive.type === 'pattern' && 'inactive must be in the format true or false'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')
