[Killed] BlockStatement
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ucsborganizations/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsborganizations/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] ArrayDeclaration
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:30:21
     const deleteCallback = async (cell) => { deleteMutation.mutate(cell); } 
 
 
-    const columns = [
-        {
-            Header: 'id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
-        {
-            Header: 'Organization Code',
-            accessor: 'orgcode',
-        },
-        {
-            Header: 'Translation Short',
-            accessor: 'orgtranslationshort',
-        },
-        {
-            Header: 'Translation',
-            accessor: 'orgtranslation',
-        },
-        {
-            Header: 'Inactive',
-            accessor: 'inactive',
-        }
-    ];
+    const columns = [];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBOrganizationsIndexPage tests renders three organizations correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:35:9
             Header: 'id',
             accessor: 'id', // accessor is the "key" in the data
         },
-        {
-            Header: 'Organization Code',
-            accessor: 'orgcode',
-        },
+        {},
         {
             Header: 'Translation Short',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:39:9
             Header: 'Organization Code',
             accessor: 'orgcode',
         },
-        {
-            Header: 'Translation Short',
-            accessor: 'orgtranslationshort',
-        },
+        {},
         {
             Header: 'Translation',
killedBy: UCSBOrganizationsIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:41:23
         },
         {
             Header: 'Translation Short',
-            accessor: 'orgtranslationshort',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationsTable-cell-row-0-col-orgtranslationshort"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:48:21
             accessor: 'orgtranslation',
         },
         {
-            Header: 'Inactive',
+            Header: "",
             accessor: 'inactive',
         }
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Inactive. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
