[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:20:44
     }
   });
 
-  const onSuccess = (ucsbOrganizations) => {
-    toast(`New ucsbOrganizations Created - id: ${ucsbOrganizations.id} orgCode: ${ucsbOrganizations.orgCode}`);
-  }
+  const onSuccess = (ucsbOrganizations) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbOrganizations Created - id: 16 orgCode: ZPR"

Number of calls: 0
