[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:15:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/ucsborganizations?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/ucsborganizations`,
-        params: {
-          id
-        }
-      }
+      {}
     );
 
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (ucsbOrganizations) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: {
-      id: ucsbOrganizations.id,
-    },
-    data: {
-      orgCode: ucsbOrganizations.orgCode,
-      orgTranslationShort: ucsbOrganizations.orgTranslationShort,
-      orgTranslation: ucsbOrganizations.orgTranslation, 
-      inactive: ucsbOrganizations.inactive
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbOrganizations) => {
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganizations Updated - id: 17 orgCode: DSP"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:28:13
   const objectToAxiosPutParams = (ucsbOrganizations) => ({
     url: "/api/ucsborganizations",
     method: "PUT",
-    params: {
-      id: ucsbOrganizations.id,
-    },
+    params: {},
     data: {
       orgCode: ucsbOrganizations.orgCode,
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:39:44
     }
   });
 
-  const onSuccess = (ucsbOrganizations) => {
-    toast(`UCSBOrganizations Updated - id: ${ucsbOrganizations.id} orgCode: ${ucsbOrganizations.orgCode}`);
-  }
+  const onSuccess = (ucsbOrganizations) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:40:11
   });
 
   const onSuccess = (ucsbOrganizations) => {
-    toast(`UCSBOrganizations Updated - id: ${ucsbOrganizations.id} orgCode: ${ucsbOrganizations.orgCode}`);
+    toast(``);
   }
 
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganizations Updated - id: 17 orgCode: DSP"
Received: ""

Number of calls: 1
