[Killed] BooleanLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:103:66
                             id="inactive"
                             type="text"
                             isInvalid={Boolean(errors.inactive)}
-                            {...register("inactive", { required: true, pattern: /true|false|TRUE|FALSE|True|False/})}
+                            {...register("inactive", { required: false, pattern: /true|false|TRUE|FALSE|True|False/})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /inactive is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:103:54
                             id="inactive"
                             type="text"
                             isInvalid={Boolean(errors.inactive)}
-                            {...register("inactive", { required: true, pattern: /true|false|TRUE|FALSE|True|False/})}
+                            {...register("inactive", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests Correct Error messsages on bad input
statusReason: TypeError: e is not a function
