[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:105:72
                             isInvalid={Boolean(errors.inactive)}
                             {...register("inactive", {
                                 required: "inactive is required.",
-                                validate: value => value === 'true' || value === 'false' || "inactive must be in the format true or false" 
+                                validate: value => value === 'true' || false || "inactive must be in the format true or false" 
                             })}
                         />
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:105:52
                             isInvalid={Boolean(errors.inactive)}
                             {...register("inactive", {
                                 required: "inactive is required.",
-                                validate: value => value === 'true' || value === 'false' || "inactive must be in the format true or false" 
+                                validate: value => value === 'true' && value === 'false' || "inactive must be in the format true or false" 
                             })}
                         />
killedBy: UCSBOrganizationsForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
