[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:5:79
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom'
 
-function UCSBOrganizationsForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function UCSBOrganizationsForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     // Stryker disable all
killedBy: UCSBOrganizationsForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:37:65
                             id="orgCode"
                             type="text"
                             isInvalid={Boolean(errors.orgCode)}
-                            {...register("orgCode", { required: true })}
+                            {...register("orgCode", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /orgCode is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:52:77
                             id="orgTranslationShort"
                             type="text"
                             isInvalid={Boolean(errors.orgTranslationShort)}
-                            {...register("orgTranslationShort", { required: true })}
+                            {...register("orgTranslationShort", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslationShort is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:55:30
                             {...register("orgTranslationShort", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.orgTranslationShort && 'orgTranslationShort is required.'}
+                            {errors.orgTranslationShort || 'orgTranslationShort is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationsForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] BooleanLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:67:72
                             id="orgTranslation"
                             type="text"
                             isInvalid={Boolean(errors.orgTranslation)}
-                            {...register("orgTranslation", { required: true })}
+                            {...register("orgTranslation", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:70:30
                             {...register("orgTranslation", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.orgTranslation && 'orgTranslation is required.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBOrganizationsForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:86:54
                             id="inactive"
                             type="text"
                             isInvalid={Boolean(errors.inactive)}
-                            {...register("inactive", {
-                                required: "inactive is required.",
-                                validate: value => value === 'true' || value === 'false' || "inactive must be in the format true or false" 
-                            })}
+                            {...register("inactive", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests Correct Error messsages on bad input
statusReason: TypeError: e is not a function

[Killed] ArrowFunction
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:88:43
                             isInvalid={Boolean(errors.inactive)}
                             {...register("inactive", {
                                 required: "inactive is required.",
-                                validate: value => value === 'true' || value === 'false' || "inactive must be in the format true or false" 
+                                validate: () => undefined 
                             })}
                         />
killedBy: UCSBOrganizationsForm tests Correct Error messsages on bad input
statusReason: TypeError: e is not a function

[Killed] LogicalOperator
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:88:52
                             isInvalid={Boolean(errors.inactive)}
                             {...register("inactive", {
                                 required: "inactive is required.",
-                                validate: value => value === 'true' || value === 'false' || "inactive must be in the format true or false" 
+                                validate: value => (value === 'true' || value === 'false') && "inactive must be in the format true or false" 
                             })}
                         />
killedBy: UCSBOrganizationsForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /inactive must be in the format true or false/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
