[Killed] ArrayDeclaration
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:30:21
     const deleteCallback = async (cell) => { deleteMutation.mutate(cell); } 
 
 
-    const columns = [
-        {
-            Header: 'OrgCode',
-            accessor: 'orgCode',
-        },
-        {
-            Header: 'OrgTranslationShort',
-            accessor: 'orgTranslationShort',
-        },
-        {
-            Header: 'OrgTranslation',
-            accessor: 'orgTranslation',
-        },
-        {
-            Header: 'Inactive',
-            accessor: 'inactive'
-        }
-    ];
+    const columns = [];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBOrganizationsIndexPage tests renders three organizations correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsTable-cell-row-0-col-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:31:9
 
 
     const columns = [
-        {
-            Header: 'OrgCode',
-            accessor: 'orgCode',
-        },
+        {},
         {
             Header: 'OrgTranslationShort',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:33:23
     const columns = [
         {
             Header: 'OrgCode',
-            accessor: 'orgCode',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationsTable-cell-row-0-col-orgCode"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:49:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationsTable"));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
 
     return <OurTable
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationsTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:50:43
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationsTable"));
+        columns.push(ButtonColumn("Edit", "", editCallback, "UCSBOrganizationsTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationsTable"));
     } 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:50:35
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationsTable"));
+        columns.push(ButtonColumn("", "primary", editCallback, "UCSBOrganizationsTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationsTable"));
     } 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:51:45
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationsTable"));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, "UCSBOrganizationsTable"));
     } 
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
