[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:9:31
 
 export default function UCSBOrganizationsCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsbOrganizations) => ({
-    url: "/api/ucsborganizations/post",
-    method: "POST",
-    params: {
-      orgCode: ucsbOrganizations.orgCode,
-      orgTranslationShort: ucsbOrganizations.orgTranslationShort,
-      orgTranslation: ucsbOrganizations.orgTranslation, 
-      inactive: ucsbOrganizations.inactive
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbOrganizations) => {
killedBy: UCSBOrganizationsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:10:10
 export default function UCSBOrganizationsCreatePage({storybook=false}) {
 
   const objectToAxiosParams = (ucsbOrganizations) => ({
-    url: "/api/ucsborganizations/post",
+    url: "",
     method: "POST",
     params: {
killedBy: UCSBOrganizationsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbOrganizations Created orgCode: ZPR"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:12:13
   const objectToAxiosParams = (ucsbOrganizations) => ({
     url: "/api/ucsborganizations/post",
     method: "POST",
-    params: {
-      orgCode: ucsbOrganizations.orgCode,
-      orgTranslationShort: ucsbOrganizations.orgTranslationShort,
-      orgTranslation: ucsbOrganizations.orgTranslation, 
-      inactive: ucsbOrganizations.inactive
-    }
+    params: {}
   });
 
killedBy: UCSBOrganizationsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "inactive": "true",
-   "orgCode": "ZPR",

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:20:44
     }
   });
 
-  const onSuccess = (ucsbOrganizations) => {
-    toast(`New ucsbOrganizations Created orgCode: ${ucsbOrganizations.orgCode}`);
-  }
+  const onSuccess = (ucsbOrganizations) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbOrganizations Created orgCode: ZPR"

Number of calls: 0
