[Killed] StringLiteral
src/main/utils/UCSBOrganizationsUtils.js:10:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/ucsborganizations",
+        url: "",
         method: "DELETE",
         params: {
killedBy: UCSBOrganizationsIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganization with orgCode ZPR was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
src/main/utils/UCSBOrganizationsUtils.js:12:17
     return {
         url: "/api/ucsborganizations",
         method: "DELETE",
-        params: {
-            orgCode: cell.row.values.orgCode
-        }
+        params: {}
     }
 }
killedBy: UCSBOrganizationsUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Object {
    "method": "DELETE",
-   "params": Object {
