[Killed] ArrayDeclaration
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:30:21
     const deleteCallback = async (cell) => { deleteMutation.mutate(cell); } 
 
 
-    const columns = [
-        {
-            Header: 'OrgCode',
-            accessor: 'orgCode',
-        },
-        {
-            Header: 'OrgTranslationShort',
-            accessor: 'orgTranslationShort',
-        },
-        {
-            Header: 'OrgTranslation',
-            accessor: 'orgTranslation',
-        },
-        {
-            Header: 'Inactive',
-            id: 'inactive',
-            accessor: row => String(row.inactive)
-        }
-    ];
+    const columns = [];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: OrgCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:58:17
     return <OurTable
         data={organizations}
         columns={columns}
-        testid={"UCSBOrganizationsTable"}
+        testid={""}
     />;
 };
killedBy: UCSBOrganizationsIndexPage tests renders three organizations correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsTable-cell-row-0-col-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
