[Killed] ConditionalExpression
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewForm.js:33:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBMenuItemReviewForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
             </Row>
 
killedBy: UCSBMenuItemReviewForm tests renders correctly when passing in a UCSBMenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="/UCSBMenuItemReviewForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewForm.js:33:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBMenuItemReviewForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
             </Row>
 
killedBy: UCSBMenuItemReviewForm tests renders correctly when passing in a UCSBMenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="/UCSBMenuItemReviewForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewForm.js:62:30
                             {...register("itemId", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.itemId && 'Menu Item ID is required. '}
+                            {errors.itemId || 'Menu Item ID is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBMenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewForm.js:62:30
                             {...register("itemId", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.itemId && 'Menu Item ID is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBMenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Menu Item ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewForm.js:80:30
                             {...register("reviewerEmail", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.reviewerEmail && 'Email is required. '}
+                            {errors.reviewerEmail || 'Email is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBMenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewForm.js:80:30
                             {...register("reviewerEmail", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.reviewerEmail && 'Email is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBMenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewForm.js:95:51
                             id="stars"
                             type="number"
                             isInvalid={Boolean(errors.stars)}
-                            {...register("stars", { required: true, min: 1, max: 5})}
+                            {...register("stars", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBMenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Minimum rating of 1 star/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewForm.js:99:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars are required. '}
-                            {errors.stars?.type === 'min' && "Minimum rating of 1 star"}
+                            {true}
                             {errors.stars?.type === 'max' && "Maximum rating of 5 stars"}
                         </Form.Control.Feedback>
killedBy: UCSBMenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Minimum rating of 1 star/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewForm.js:99:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars are required. '}
-                            {errors.stars?.type === 'min' && "Minimum rating of 1 star"}
+                            {true && "Minimum rating of 1 star"}
                             {errors.stars?.type === 'max' && "Maximum rating of 5 stars"}
                         </Form.Control.Feedback>
killedBy: UCSBMenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Minimum rating of 1 star</div> instead

[Killed] EqualityOperator
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewForm.js:100:30
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars are required. '}
                             {errors.stars?.type === 'min' && "Minimum rating of 1 star"}
-                            {errors.stars?.type === 'max' && "Maximum rating of 5 stars"}
+                            {errors.stars?.type !== 'max' && "Maximum rating of 5 stars"}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBMenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Maximum rating of 5 stars</div> instead

[Killed] ConditionalExpression
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewForm.js:100:30
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars are required. '}
                             {errors.stars?.type === 'min' && "Minimum rating of 1 star"}
-                            {errors.stars?.type === 'max' && "Maximum rating of 5 stars"}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBMenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Maximum rating of 5 stars/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewForm.js:133:42
                             id="comments"
                             type="text"
                             isInvalid={Boolean(errors.comments)}
-                            {...register("comments", {})}
+                            {...register("", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBMenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
