[Killed] BlockStatement
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewsTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ucsbmenuitemreviews/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UCSBMenuItemReviewTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbmenuitemreviews/edit/3"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewsTable.js:35:9
             Header: 'id',
             accessor: 'id', // accessor is the "key" in the data
         },
-        {
-            Header: 'Menu Item ID',
-            accessor: 'itemId',
-        },
+        {},
         {
             Header: 'Email',
killedBy: UCSBMenuItemReviewTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewsTable.js:47:9
             Header: 'Stars',
             accessor: 'stars',
         },
-        {
-            Header: 'Date (iso format)',
-            accessor: 'dateReviewed',
-        },
+        {},
         {
             Header: 'Comments',
killedBy: UCSBMenuItemReviewTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewsTable.js:58:43
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBMenuItemReviewsTable"));
+        columns.push(ButtonColumn("Edit", "", editCallback, "UCSBMenuItemReviewsTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBMenuItemReviewsTable"));
     } 
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewsTable.js:59:45
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBMenuItemReviewsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBMenuItemReviewsTable"));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, "UCSBMenuItemReviewsTable"));
     } 
 
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/UCSBMenuItemReviews/UCSBMenuItemReviewsTable.js:65:17
     return <OurTable
         data={menuItemReviews}
         columns={columns}
-        testid={"UCSBMenuItemReviewsTable"}
+        testid={""}
     />;
 };
killedBy: UCSBMenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBMenuItemReviewsTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
