[Killed] BooleanLiteral
main/pages/UCSBMenuItemReviews/UCSBMenuItemReviewsCreatePage.js:7:66
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBMenuItemReviewsCreatePage({storybook=false}) {
+export default function UCSBMenuItemReviewsCreatePage({storybook=true}) {
 
   const objectToAxiosParams = (ucsbMenuItemReview) => ({
killedBy: UCSBMenuItemReviewsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbmenuitemreviews"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBMenuItemReviews/UCSBMenuItemReviewsCreatePage.js:9:31
 
 export default function UCSBMenuItemReviewsCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsbMenuItemReview) => ({
-    url: "/api/ucsbmenuitemreviews/post",
-    method: "POST",
-    params: {
-      itemId: ucsbMenuItemReview.itemId,
-      reviewerEmail: ucsbMenuItemReview.reviewerEmail,
-      stars: ucsbMenuItemReview.stars,
-      dateReviewed: ucsbMenuItemReview.dateReviewed,
-      comments: ucsbMenuItemReview.comments
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbMenuItemReview) => {
killedBy: UCSBMenuItemReviewsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBMenuItemReviews/UCSBMenuItemReviewsCreatePage.js:9:56
 
 export default function UCSBMenuItemReviewsCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsbMenuItemReview) => ({
-    url: "/api/ucsbmenuitemreviews/post",
-    method: "POST",
-    params: {
-      itemId: ucsbMenuItemReview.itemId,
-      reviewerEmail: ucsbMenuItemReview.reviewerEmail,
-      stars: ucsbMenuItemReview.stars,
-      dateReviewed: ucsbMenuItemReview.dateReviewed,
-      comments: ucsbMenuItemReview.comments
-    }
-  });
+  const objectToAxiosParams = (ucsbMenuItemReview) => ({});
 
   const onSuccess = (ucsbMenuItemReview) => {
killedBy: UCSBMenuItemReviewsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/UCSBMenuItemReviews/UCSBMenuItemReviewsCreatePage.js:21:45
     }
   });
 
-  const onSuccess = (ucsbMenuItemReview) => {
-    toast(`New menuItemReview Created - id: ${ucsbMenuItemReview.id} itemId: ${ucsbMenuItemReview.itemId} stars: ${ucsbMenuItemReview.stars}`);
-  }
+  const onSuccess = (ucsbMenuItemReview) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBMenuItemReviewsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New menuItemReview Created - id: 17 itemId: 3 stars: 5"

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBMenuItemReviews/UCSBMenuItemReviewsCreatePage.js:22:11
   });
 
   const onSuccess = (ucsbMenuItemReview) => {
-    toast(`New menuItemReview Created - id: ${ucsbMenuItemReview.id} itemId: ${ucsbMenuItemReview.itemId} stars: ${ucsbMenuItemReview.stars}`);
+    toast(``);
   }
 
killedBy: UCSBMenuItemReviewsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New menuItemReview Created - id: 17 itemId: 3 stars: 5"
Received: ""

Number of calls: 1
