[Killed] BlockStatement
main/pages/UCSBMenuItemReviews/UCSBMenuItemReviewsEditPage.js:3:55
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function UCSBMenuItemReviewsEditPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function UCSBMenuItemReviewsEditPage() {}
 
killedBy: UCSBMenuItemReviewsEditPage tests Renders expected content
statusReason: Error: UCSBMenuItemReviewsEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
