[Killed] BlockStatement
main/pages/UCSBMenuItemReviews/UCSBMenuItemReviewsCreatePage.js:3:57
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function UCSBMenuItemReviewsCreatePage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function UCSBMenuItemReviewsCreatePage() {}
 
killedBy: UCSBMenuItemReviewsCreatePage tests Renders expected content
statusReason: Error: UCSBMenuItemReviewsCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
